---
kind: method
id: M:Autodesk.Revit.DB.Events.DocumentPrintingEventArgs.GetSettings
source: html/6f41396e-1ebf-f600-a8f3-fd2a6837b2a1.htm
---
# Autodesk.Revit.DB.Events.DocumentPrintingEventArgs.GetSettings Method

Gets the print settings of the active printing session.

## Syntax (C#)
```csharp
public IPrintSetting GetSettings()
```

## Returns
The print settings of the active printing session.